; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 4620)
	(= (fuel plane1) 1600)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city3)
	(= (capacity plane2) 10634)
	(= (fuel plane2) 1720)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city6)
	(= (capacity plane3) 13399)
	(= (fuel plane3) 2921)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at person1 city9)
	(at person2 city1)
	(at person3 city7)
	(at person4 city0)
	(at person5 city1)
	(at person6 city6)
	(at person7 city6)
	(at person8 city5)
	(at person9 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 825)
	(= (distance city0 city2) 711)
	(= (distance city0 city3) 617)
	(= (distance city0 city4) 528)
	(= (distance city0 city5) 603)
	(= (distance city0 city6) 924)
	(= (distance city0 city7) 747)
	(= (distance city0 city8) 608)
	(= (distance city0 city9) 553)
	(= (distance city1 city0) 825)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 868)
	(= (distance city1 city3) 866)
	(= (distance city1 city4) 502)
	(= (distance city1 city5) 923)
	(= (distance city1 city6) 678)
	(= (distance city1 city7) 676)
	(= (distance city1 city8) 799)
	(= (distance city1 city9) 559)
	(= (distance city2 city0) 711)
	(= (distance city2 city1) 868)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 555)
	(= (distance city2 city4) 832)
	(= (distance city2 city5) 993)
	(= (distance city2 city6) 790)
	(= (distance city2 city7) 714)
	(= (distance city2 city8) 715)
	(= (distance city2 city9) 903)
	(= (distance city3 city0) 617)
	(= (distance city3 city1) 866)
	(= (distance city3 city2) 555)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 748)
	(= (distance city3 city5) 849)
	(= (distance city3 city6) 668)
	(= (distance city3 city7) 978)
	(= (distance city3 city8) 874)
	(= (distance city3 city9) 583)
	(= (distance city4 city0) 528)
	(= (distance city4 city1) 502)
	(= (distance city4 city2) 832)
	(= (distance city4 city3) 748)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 937)
	(= (distance city4 city6) 699)
	(= (distance city4 city7) 795)
	(= (distance city4 city8) 555)
	(= (distance city4 city9) 728)
	(= (distance city5 city0) 603)
	(= (distance city5 city1) 923)
	(= (distance city5 city2) 993)
	(= (distance city5 city3) 849)
	(= (distance city5 city4) 937)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 898)
	(= (distance city5 city7) 980)
	(= (distance city5 city8) 975)
	(= (distance city5 city9) 507)
	(= (distance city6 city0) 924)
	(= (distance city6 city1) 678)
	(= (distance city6 city2) 790)
	(= (distance city6 city3) 668)
	(= (distance city6 city4) 699)
	(= (distance city6 city5) 898)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 534)
	(= (distance city6 city8) 844)
	(= (distance city6 city9) 873)
	(= (distance city7 city0) 747)
	(= (distance city7 city1) 676)
	(= (distance city7 city2) 714)
	(= (distance city7 city3) 978)
	(= (distance city7 city4) 795)
	(= (distance city7 city5) 980)
	(= (distance city7 city6) 534)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 537)
	(= (distance city7 city9) 767)
	(= (distance city8 city0) 608)
	(= (distance city8 city1) 799)
	(= (distance city8 city2) 715)
	(= (distance city8 city3) 874)
	(= (distance city8 city4) 555)
	(= (distance city8 city5) 975)
	(= (distance city8 city6) 844)
	(= (distance city8 city7) 537)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 551)
	(= (distance city9 city0) 553)
	(= (distance city9 city1) 559)
	(= (distance city9 city2) 903)
	(= (distance city9 city3) 583)
	(= (distance city9 city4) 728)
	(= (distance city9 city5) 507)
	(= (distance city9 city6) 873)
	(= (distance city9 city7) 767)
	(= (distance city9 city8) 551)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane2 city2)
	(at person1 city7)
	(at person2 city8)
	(at person4 city0)
	(at person5 city4)
	(at person6 city4)
	(at person7 city3)
	(at person8 city1)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane3 city6)
   changed: (fuel plane3) from 2921 to 13399
   goals met: 1 of 9
2. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 1004, (fuel plane1) from 1600 to 596
   goals met: 2 of 9
3. (board person6 plane3 city6)
   deleted: (at person6 city6)
   added: (in person6 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 9
4. (board person7 plane3 city6)
   deleted: (at person7 city6)
   added: (in person7 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 9
5. (zoom plane3 city6 city4)
   deleted: (at plane3 city6)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 1004 to 8693, (fuel plane3) from 13399 to 5710
   goals met: 2 of 9
6. (debark person6 plane3 city4)
   deleted: (in person6 plane3)
   added: (at person6 city4)
   changed: (onboard plane3) from 2 to 1
   goals met: 3 of 9
7. (refuel plane2 city3)
   changed: (fuel plane2) from 1720 to 10634
   goals met: 3 of 9
8. (zoom plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 8693 to 13133, (fuel plane2) from 10634 to 6194
   goals met: 4 of 9
9. (fly plane3 city4 city3)
   deleted: (at plane3 city4)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 13133 to 16873, (fuel plane3) from 5710 to 1970
   goals met: 4 of 9
10. (debark person7 plane3 city3)
   deleted: (in person7 plane3)
   added: (at person7 city3)
   changed: (onboard plane3) from 1 to 0
   goals met: 5 of 9
11. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 9
12. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 9
13. (refuel plane1 city1)
   changed: (fuel plane1) from 596 to 4620
   goals met: 5 of 9
14. (fly plane1 city1 city8)
   deleted: (at plane1 city1)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 16873 to 18471, (fuel plane1) from 4620 to 3022
   goals met: 4 of 9
15. (debark person2 plane1 city8)
   deleted: (in person2 plane1)
   added: (at person2 city8)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 9
16. (fly plane1 city8 city9)
   deleted: (at plane1 city8)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 18471 to 19573, (fuel plane1) from 3022 to 1920
   goals met: 5 of 9
17. (board person1 plane1 city9)
   deleted: (at person1 city9)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 9
18. (fly plane1 city9 city1)
   deleted: (at plane1 city9)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 19573 to 20691, (fuel plane1) from 1920 to 802
   goals met: 6 of 9
19. (refuel plane1 city1)
   changed: (fuel plane1) from 802 to 4620
   goals met: 6 of 9
20. (fly plane1 city1 city7)
   deleted: (at plane1 city1)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 20691 to 22043, (fuel plane1) from 4620 to 3268
   goals met: 5 of 9
21. (debark person1 plane1 city7)
   deleted: (in person1 plane1)
   added: (at person1 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 9
22. (fly plane1 city7 city1)
   deleted: (at plane1 city7)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 22043 to 23395, (fuel plane1) from 3268 to 1916
   goals met: 7 of 9
23. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 23395 to 25241, (fuel plane1) from 1916 to 70
   goals met: 6 of 9
24. (refuel plane1 city5)
   changed: (fuel plane1) from 70 to 4620
   goals met: 6 of 9
25. (board person8 plane1 city5)
   deleted: (at person8 city5)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 9
26. (fly plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 25241 to 27087, (fuel plane1) from 4620 to 2774
   goals met: 7 of 9
27. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 9
28. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 27087 to 28091, (fuel plane1) from 2774 to 1770
   goals met: 7 of 9
29. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
30. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 28091 to 29095, (fuel plane1) from 1770 to 766
   goals met: 9 of 9
